
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 8-core Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Rafael
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "onet_characteristics.do" 

. //JOB TITLES
. import delimited using "../input/ONET_Occupation_Data.txt", delim(tab) clear 
> varnames(1)
(3 vars, 1,110 obs)

. tempfile tf_occtitles

. save `tf_occtitles'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000001.tmp saved

. 
. //JOB CHARACTERISTICS: WORK ACTIVITIES
. import delimited using "../input/ONET_Work_Activities.txt", delim(tab) clear
(13 vars, 79,376 obs)

. keep if inlist(elementid,"4.A.3.a.1","4.A.3.a.2","4.A.3.a.3","4.A.3.a.4","4.A
> .4.a.8","4.A.3.b.4","4.A.3.b.5","4.A.1.b.2")
(63,888 observations deleted)

. bys onetsoccode: egen byte physical_activities = max(elementid=="4.A.3.a.1" &
>  scaleid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable physical_activities "Performing General Physical Activities is
>  very important (4.0+ of 5)"

. bys onetsoccode: egen byte handlingobjects = max(elementid=="4.A.3.a.2" & sca
> leid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable handlingobjects "Handling and Moving Objects is very important
>  (4.0+ of 5)"

. bys onetsoccode: egen byte control_machines = max(elementid=="4.A.3.a.3" & sc
> aleid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable control_machines "Controlling Machines and Processes [not comp
> uters nor vehicles] is very important (4.0+ of 5)"
note: label truncated to 80 characters

. bys onetsoccode: egen byte operate_equipment = max(elementid=="4.A.3.a.4" & s
> caleid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable operate_equipment "Operating Vehicles, Mechanized Devices, or 
> Equipment is very important (4.0+ of 5)"
note: label truncated to 80 characters

. bys onetsoccode: egen byte dealwithpublic = max(elementid=="4.A.4.a.8" & scal
> eid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable dealwithpublic "Performing for or Working Directly with the Pu
> blic is very important (4.0+ of 5)"

. bys onetsoccode: egen byte repair_mechequip = max(elementid=="4.A.3.b.4" & sc
> aleid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable repair_mechequip "Repairing and Maintaining Mechanical Equipme
> nt is very important (4.0+ of 5)"

. bys onetsoccode: egen byte repair_elecequip = max(elementid=="4.A.3.b.5" & sc
> aleid=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable repair_elecequip "Repairing and Maintaining Electronic Equipme
> nt is very important (4.0+ of 5)"

. bys onetsoccode: egen byte inspect_equip = max(elementid=="4.A.1.b.2" & scale
> id=="IM" & inrange(datavalue,4.0,5.0)==1)

. label variable inspect_equip "Inspecting Equipment, Structures, or Materials 
> is very important (4.0+ of 5)"

. 
. destring n, force replace
n: contains nonnumeric characters; replaced as byte
(16 missing values generated)

. collapse (firstnm) physical_activities handlingobjects control_machines opera
> te_equipment dealwithpublic repair_mechequip repair_elecequip inspect_equip (
> mean) n, by(onetsoccode)

. 
. tempfile tf_workactivities

. save `tf_workactivities'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000002.tmp saved

. 
. //JOB CHARACTERISTICS: WORK CONTEXT
. import delimited using "../input/ONET_Work_Context.txt", delim(tab) clear
(14 vars, 326,884 obs)

. keep if inlist(elementid,"4.C.1.a.4","4.C.2.a.1.c","4.C.2.a.1.d","4.C.2.a.1.e
> ","4.C.2.a.1.f","4.C.2.d.1.c","4.C.2.d.1.g","4.C.3.d.3")==1 | ///
> inlist(elementid,"4.C.1.a.2.f","4.C.1.a.2.h","4.C.1.b.1.f","4.C.1.b.1.g","4.C
> .1.c.1","4.C.1.d.3","4.C.2.a.1.b","4.C.2.a.3")==1 | ///
> inlist(elementid,"4.C.2.b.1.b","4.C.2.b.1.d","4.C.2.b.1.e","4.C.2.b.1.f","4.C
> .2.c.1.a","4.C.2.c.1.b","4.C.2.c.1.c","4.C.2.c.1.d")==1 | ///
> inlist(elementid,"4.C.2.c.1.e","4.C.2.c.1.f","4.C.2.d.1.d","4.C.2.d.1.e","4.C
> .2.d.1.f","4.C.2.d.1.h","4.C.2.d.1.i","4.C.2.e.1.d")==1 | ///
> inlist(elementid,"4.C.2.e.1.e","4.C.2.d.1.a","4.C.2.d.1.b")==1
(123,786 observations deleted)

. 
. keep if scaleid=="CX"
(169,225 observations deleted)

. 
. bys onetsoccode: egen byte sitting_continually = max(elementid=="4.C.2.d.1.a"
>  & inrange(datavalue,4.5,5.0)==1)

. label variable sitting_continually "Average respondent says they are sitting 
> almost continually"

. bys onetsoccode: egen byte standing_continually = max(elementid=="4.C.2.d.1.b
> " & inrange(datavalue,4.5,5.0)==1)

. label variable standing_continually "Average respondent says they are standin
> g almost continually"

. bys onetsoccode: egen byte handsontools = max(elementid=="4.C.2.d.1.g" & inra
> nge(datavalue,3.5,5.0)==1)

. label variable handsontools "Majority of time is spent using your hands to ha
> ndle, control, or feel objects, tools, or controls"
note: label truncated to 80 characters

. bys onetsoccode: egen byte outdoors_everyday = max(inlist(elementid,"4.C.2.a.
> 1.c","4.C.2.a.1.d") & inrange(datavalue,4.5,5.0)==1)

. label variable outdoors_everyday "Majority of respondents say outdoors every 
> day"

. bys onetsoccode: egen byte email_lessthanmonthly = max(elementid=="4.C.1.a.2.
> h" & inrange(datavalue,1.0,2.0)==1)

. label variable email_lessthanmonthly "Average respondent says they use email 
> less than once per month"

. bys onetsoccode: egen byte telephone_lessthanmonthly = max(elementid=="4.C.1.
> a.2.f" & inrange(datavalue,1.0,2.0)==1)

. label variable telephone_lessthanmonthly "Average respondent says they use te
> lephone less than once per month"

. bys onetsoccode: egen byte climbing_majority = max(elementid=="4.C.2.d.1.c" &
>  inrange(datavalue,3.5,5.0)==1)

. label variable climbing_majority "Average respondent says they spent majority
>  of time climbing ladders, scaffolds, or poles"
note: label truncated to 80 characters

. bys onetsoccode: egen byte walking_majority = max(elementid=="4.C.2.d.1.d" & 
> inrange(datavalue,3.5,5.0)==1)

. label variable walking_majority "Average respondent says they spent majority 
> of time walking or running"

. bys onetsoccode: egen byte crouching_majority = max(elementid=="4.C.2.d.1.e" 
> & inrange(datavalue,3.5,5.0)==1)

. label variable crouching_majority "Average respondent says they spent majorit
> y of time kneeling, crouching, stooping, or crawling"
note: label truncated to 80 characters

. bys onetsoccode: egen byte keepingbalance_majority = max(elementid=="4.C.2.d.
> 1.f" & inrange(datavalue,3.5,5.0)==1)

. label variable keepingbalance_majority "Average respondent says they spent ma
> jority of time keeping or regaining your balance"
note: label truncated to 80 characters

. bys onetsoccode: egen byte bendingbody_majority = max(elementid=="4.C.2.d.1.h
> " & inrange(datavalue,3.5,5.0)==1)

. label variable bendingbody_majority "Average respondent says they spent major
> ity of time bending or twisting your body"
note: label truncated to 80 characters

. bys onetsoccode: egen byte repetitivemotion_majority = max(elementid=="4.C.2.
> d.1.i" & inrange(datavalue,3.5,5.0)==1)

. label variable repetitivemotion_majority "Average respondent says they spent 
> majority of time making repetitive motions"

. bys onetsoccode: egen byte safetyequip_majority = max(inlist(elementid,"4.C.2
> .e.1.d","4.C.2.e.1.e") & inrange(datavalue,3.5,5.0)==1)

. label variable safetyequip_majority "Average respondent says they spent major
> ity of time wearing common or specialized protective or safety equipment"
note: label truncated to 80 characters

. bys onetsoccode: egen byte contactothers_majority = max(elementid=="4.C.1.a.4
> " & inrange(datavalue,3.5,5.0)==1)

. label variable contactothers_majority "Average respondent says they spent maj
> ority of time contact with others"

. bys onetsoccode: egen byte externalcustomer_veryimportant = max(elementid=="4
> .C.1.b.1.f" & inrange(datavalue,4.0,5.0)==1)

. label variable externalcustomer_veryimportant "Average respondent says it is 
> very important for them to deal with external customers"
note: label truncated to 80 characters

. bys onetsoccode: egen byte coordothers_veryimportant = max(elementid=="4.C.1.
> b.1.g" & inrange(datavalue,4.0,5.0)==1)

. label variable coordothers_veryimportant "Average respondent says it is very 
> important for them to coordinate or lead others"
note: label truncated to 80 characters

. bys onetsoccode: egen byte othershealth_veryimportant = max(elementid=="4.C.1
> .c.1" & inrange(datavalue,4.0,5.0)==1)

. label variable othershealth_veryimportant "Average respondent says it is very
>  important for them to responsible for others' health and safety"
note: label truncated to 80 characters

. bys onetsoccode: egen byte violentpeople_atleastweekly = max(elementid=="4.C.
> 1.d.3" & inrange(datavalue,4.0,5.0)==1)

. label variable violentpeople_atleastweekly "Average respondent says they deal
>  with violent people at least once a week"

. bys onetsoccode: egen byte noac_everyday = max(elementid=="4.C.2.a.1.b" & inr
> ange(datavalue,4.5,5.0)==1)

. label variable noac_everyday "Average respondent says they work in an environ
> ment that is not environmentally controlled every day"
note: label truncated to 80 characters

. bys onetsoccode: egen byte physicalclose_atleastmoderate = max(elementid=="4.
> C.2.a.3" & inrange(datavalue,4.0,5.0)==1)

. label variable physicalclose_atleastmoderate "Average respondent says they ar
> e physically close (at least moderately close) to others"
note: label truncated to 80 characters

. bys onetsoccode: egen byte extremetemp_everyday = max(elementid=="4.C.2.b.1.b
> " & inrange(datavalue,4.0,5.0)==1)

. label variable extremetemp_everyday "Average respondent says extreme temperat
> ures every day"

. bys onetsoccode: egen byte contaminant_atleastweekly = max(elementid=="4.C.2.
> b.1.d" & inrange(datavalue,4.0,5.0)==1)

. label variable contaminant_atleastweekly "Average respondent says they are ex
> posed to contaminants at least once a week"

. bys onetsoccode: egen byte crampedspace_everyday = max(elementid=="4.C.2.b.1.
> e" & inrange(datavalue,4.5,5.0)==1)

. label variable crampedspace_everyday "Average respondent says they are expose
> d to cramped work space every day"

. bys onetsoccode: egen byte bodyvibration_atleastweekly = max(elementid=="4.C.
> 2.b.1.f" & inrange(datavalue,4.0,5.0)==1)

. label variable bodyvibration_atleastweekly "Average respondent says they are 
> exposed to whole body vibration at least once a week"
note: label truncated to 80 characters

. bys onetsoccode: egen byte radiation_atleastweekly = max(elementid=="4.C.2.c.
> 1.a" & inrange(datavalue,4.0,5.0)==1)

. label variable radiation_atleastweekly "Average respondent says they are expo
> sed to radiation at least once a week"

. bys onetsoccode: egen byte disease_atleastweekly = max(elementid=="4.C.2.c.1.
> b" & inrange(datavalue,4.0,5.0)==1)

. label variable disease_atleastweekly "Average respondent says they are expose
> d to diseases or infection at least once a week"
note: label truncated to 80 characters

. bys onetsoccode: egen byte highplace_atleastweekly = max(elementid=="4.C.2.c.
> 1.c" & inrange(datavalue,4.0,5.0)==1)

. label variable highplace_atleastweekly "Average respondent says they are expo
> sed to high places at least once a week"

. bys onetsoccode: egen byte hazardcond_atleastweekly = max(elementid=="4.C.2.c
> .1.d" & inrange(datavalue,4.0,5.0)==1)

. label variable hazardcond_atleastweekly "Average respondent says they are exp
> osed to hazardous conditions at least once a week"
note: label truncated to 80 characters

. bys onetsoccode: egen byte hazardequip_atleastweekly = max(elementid=="4.C.2.
> c.1.e" & inrange(datavalue,4.0,5.0)==1)

. label variable hazardequip_atleastweekly "Average respondent says they are ex
> posed to hazardous equipment at least once a week"
note: label truncated to 80 characters

. bys onetsoccode: egen byte minorhurt_atleastweekly = max(elementid=="4.C.2.c.
> 1.f" & inrange(datavalue,4.0,5.0)==1)

. label variable minorhurt_atleastweekly "Average respondent says they are expo
> sed to minor burns, cuts, bites, or stings at least once a week"
note: label truncated to 80 characters

. 
. keep onetsoccode sitting_continually standing_continually handsontools outdoo
> rs_everyday email_lessthanmonthly telephone_lessthanmonthly climbing_majority
>  walking_majority crouching_majority keepingbalance_majority bendingbody_majo
> rity repetitivemotion_majority safetyequip_majority contactothers_majority ex
> ternalcustomer_veryimportant coordothers_veryimportant othershealth_veryimpor
> tant violentpeople_atleastweekly noac_everyday physicalclose_atleastmoderate 
> extremetemp_everyday contaminant_atleastweekly crampedspace_everyday bodyvibr
> ation_atleastweekly radiation_atleastweekly disease_atleastweekly highplace_a
> tleastweekly hazardcond_atleastweekly hazardequip_atleastweekly minorhurt_atl
> eastweekly

. duplicates drop

Duplicates in terms of all variables

(32,905 observations deleted)

. 
. tempfile tf_workcontext

. save `tf_workcontext'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000003.tmp saved

. 
. //Merge three files
. use `tf_workcontext', clear

. merge 1:1 onetsoccode using `tf_workactivities', assert(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               968  
    -----------------------------------------

. merge m:1 onetsoccode using `tf_occtitles', assert(using match) keep(match) n
> ogen keepusing(title)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               968  
    -----------------------------------------

. gen byte teleworkable = (email_lessthanmonthly==0 & outdoors_everyday==0 & vi
> olentpeople_atleastweekly==0 & safetyequip_majority == 0 & minorhurt_atleastw
> eekly==0 & physical_activities==0 & handlingobjects==0 & control_machines==0 
> & operate_equipment==0 & dealwithpublic==0 & repair_mechequip==0 & repair_ele
> cequip==0 & inspect_equip==0 & disease_atleastweekly==0 & walking_majority==0
> )

. save "../output/onet_teleworkable_detail.dta", replace
(note: file ../output/onet_teleworkable_detail.dta not found)
file ../output/onet_teleworkable_detail.dta saved

. keep onetsoccode title teleworkable n

. save "../output/onet_teleworkable.dta", replace
(note: file ../output/onet_teleworkable.dta not found)
file ../output/onet_teleworkable.dta saved

. 
. //Export CSV for distribution
. keep onetsoccode title teleworkable

. export delimited using "../output/occupations_workathome.csv", replace
file ../output/occupations_workathome.csv saved

. 
end of do-file
