
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 8-core Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Rafael
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "blscodes_characteristics_explore.do" 

. 
. local jobs_chars_vars = "violentpeople_atleastweekly repair_elecequip minorhu
> rt_atleastweekly repair_mechequip outdoors_everyday disease_atleastweekly ope
> rate_equipment physical_activities handlingobjects control_machines walking_m
> ajority email_lessthanmonthly dealwithpublic inspect_equip safetyequip_majori
> ty"

. 
. //The next 40 lines mimic the content of onet_to_BLS_crosswalk/code/crosswalk
> .do, now applied to ../input/onet_teleworkable_detail.dta
. 
. //MAP O*NET TELEWORK SCORE to BLS's 6-digit SOC categories
. 
. tempfile tf_onet_soc tf_soc_bls tf_bls_telework

. 
. import excel using "../input/2010_to_SOC_Crosswalk.xlsx", firstrow cellrange(
> A4:D1114) clear

. rename ONETSOC2010Code onetsoccode

. rename SOCCode SOC_2010

. rename SOCTitle SOC_TITLE

. save `tf_onet_soc'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000001.tmp saved

. 
. import excel using "../input/oes_2019_hybrid_structure.xlsx", sheet(OES2019 H
> ybrid) cellrange(A6:H874) clear firstrow

. rename (OES2018EstimatesCode OES2018EstimatesTitle) (OES_2018 OES_TITLE)

. rename (G H) (SOC_2010 SOC_TITLE)

. keep OES_2018 OES_TITLE SOC_2010 SOC_TITLE

. replace OES_TITLE = trim(OES_TITLE)
(49 real changes made)

. duplicates drop

Duplicates in terms of all variables

(47 observations deleted)

. save `tf_soc_bls'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000002.tmp saved

. 
. use "../input/onet_teleworkable_detail.dta", clear

. merge 1:1 onetsoccode using `tf_onet_soc', assert(using match) keep(match) ke
> epusing(SOC_2010) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               968  
    -----------------------------------------

. bys SOC_2010: egen total = total(1)

. by  SOC_2010: egen stddev_telew = sd(telew)
(678 missing values generated)

. list onetsoccode title SOC_2010 teleworkable if total!=1 & stddev_telew!=0 //
> Taking survey-respondent-weighted averages to get to SOC_2010

     +------------------------------------------------------------------------+
 19. |                               onetsocc~e                               |
     |                               11-3071.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Transportation Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 20. |                               onetsocc~e                               |
     |                               11-3071.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Storage and Distribution Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 21. |                               onetsocc~e                               |
     |                               11-3071.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Logistics Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 34. |                               onetsocc~e                               |
     |                               11-9041.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                 Architectural and Engineering Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 35. |                               onetsocc~e                               |
     |                               11-9041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |         Biofuels/Biodiesel Technology and Product Development Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 48. |                               onetsocc~e                               |
     |                               11-9199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                            Regulatory Affairs Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 49. |                               onetsocc~e                               |
     |                               11-9199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Compliance Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 50. |                               onetsocc~e                               |
     |                               11-9199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Investment Fund Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 51. |                               onetsocc~e                               |
     |                               11-9199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Supply Chain Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 52. |                               onetsocc~e                               |
     |                               11-9199.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Security Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 53. |                               onetsocc~e                               |
     |                               11-9199.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Loss Prevention Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 54. |                               onetsocc~e                               |
     |                               11-9199.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Wind Energy Operations Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 55. |                               onetsocc~e                               |
     |                               11-9199.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Wind Energy Project Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 56. |                               onetsocc~e                               |
     |                               11-9199.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                 Brownfield Redevelopment Specialists and Site Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 64. |                               onetsocc~e                               |
     |                               13-1041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                    Environmental Compliance Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 65. |                               onetsocc~e                               |
     |                               13-1041.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Licensing Examiners and Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 66. |                               onetsocc~e                               |
     |                               13-1041.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                         Equal Opportunity Representatives and Officers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 67. |                               onetsocc~e                               |
     |                               13-1041.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                       Government Property Inspectors and Investigators |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 68. |                               onetsocc~e                               |
     |                               13-1041.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                               Coroners |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 69. |                               onetsocc~e                               |
     |                               13-1041.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Regulatory Affairs Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 83. |                               onetsocc~e                               |
     |                               13-1199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Energy Auditors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 84. |                               onetsocc~e                               |
     |                               13-1199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Security Management Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 85. |                               onetsocc~e                               |
     |                               13-1199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Customs Brokers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 86. |                               onetsocc~e                               |
     |                               13-1199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Business Continuity Planners |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 87. |                               onetsocc~e                               |
     |                               13-1199.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Sustainability Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 88. |                               onetsocc~e                               |
     |                               13-1199.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Online Merchants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
143. |                               onetsocc~e                               |
     |                               17-1022.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                              Surveyors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-1022              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
144. |                               onetsocc~e                               |
     |                               17-1022.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Geodetic Surveyors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-1022              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
157. |                               onetsocc~e                               |
     |                               17-2111.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                 Industrial Safety and Health Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
158. |                               onetsocc~e                               |
     |                               17-2111.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                               Fire-Prevention and Protection Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
159. |                               onetsocc~e                               |
     |                               17-2111.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Product Safety Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
160. |                               onetsocc~e                               |
     |                               17-2112.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Industrial Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2112              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
161. |                               onetsocc~e                               |
     |                               17-2112.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                Human Factors Engineers and Ergonomists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2112              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
162. |                               onetsocc~e                               |
     |                               17-2121.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Marine Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2121              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
163. |                               onetsocc~e                               |
     |                               17-2121.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Marine Architects |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2121              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
165. |                               onetsocc~e                               |
     |                               17-2141.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Mechanical Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
166. |                               onetsocc~e                               |
     |                               17-2141.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Fuel Cell Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
167. |                               onetsocc~e                               |
     |                               17-2141.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Automotive Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
171. |                               onetsocc~e                               |
     |                               17-2199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Biochemical Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
172. |                               onetsocc~e                               |
     |                               17-2199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Validation Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
173. |                               onetsocc~e                               |
     |                               17-2199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Energy Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
174. |                               onetsocc~e                               |
     |                               17-2199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Manufacturing Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
175. |                               onetsocc~e                               |
     |                               17-2199.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Mechatronics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
176. |                               onetsocc~e                               |
     |                               17-2199.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Microsystems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
177. |                               onetsocc~e                               |
     |                               17-2199.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Photonics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
178. |                               onetsocc~e                               |
     |                               17-2199.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Robotics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
179. |                               onetsocc~e                               |
     |                               17-2199.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Nanosystems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
180. |                               onetsocc~e                               |
     |                               17-2199.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Wind Energy Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
181. |                               onetsocc~e                               |
     |                               17-2199.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Solar Energy Systems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
208. |                               onetsocc~e                               |
     |                               17-3031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Surveying Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-3031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
209. |                               onetsocc~e                               |
     |                               17-3031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Mapping Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-3031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
217. |                               onetsocc~e                               |
     |                               19-1029.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                              Bioinformatics Scientists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
218. |                               onetsocc~e                               |
     |                               19-1029.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Molecular and Cellular Biologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
219. |                               onetsocc~e                               |
     |                               19-1029.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                            Geneticists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
220. |                               onetsocc~e                               |
     |                               19-1031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Soil and Water Conservationists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
221. |                               onetsocc~e                               |
     |                               19-1031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Range Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
222. |                               onetsocc~e                               |
     |                               19-1031.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Park Naturalists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
258. |                               onetsocc~e                               |
     |                               19-4041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Geophysical Data Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
259. |                               onetsocc~e                               |
     |                               19-4041.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Geological Sample Test Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
262. |                               onetsocc~e                               |
     |                               19-4061.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Social Science Research Assistants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4061              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
263. |                               onetsocc~e                               |
     |                               19-4061.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                       City and Regional Planning Aides |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4061              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
267. |                               onetsocc~e                               |
     |                               19-4099.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Quality Control Analysts |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
268. |                               onetsocc~e                               |
     |                               19-4099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Precision Agriculture Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
269. |                               onetsocc~e                               |
     |                               19-4099.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Remote Sensing Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
365. |                               onetsocc~e                               |
     |                               27-2012.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                              Producers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
366. |                               onetsocc~e                               |
     |                               27-2012.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |               Directors- Stage, Motion Pictures, Television, and Radio |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
367. |                               onetsocc~e                               |
     |                               27-2012.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Program Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
368. |                               onetsocc~e                               |
     |                               27-2012.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Talent Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
369. |                               onetsocc~e                               |
     |                               27-2012.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Technical Directors/Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
375. |                               onetsocc~e                               |
     |                               27-2041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Music Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
376. |                               onetsocc~e                               |
     |                               27-2041.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                          Music Composers and Arrangers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
411. |                               onetsocc~e                               |
     |                               29-1069.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Allergists and Immunologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
412. |                               onetsocc~e                               |
     |                               29-1069.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Dermatologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
413. |                               onetsocc~e                               |
     |                               29-1069.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Hospitalists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
414. |                               onetsocc~e                               |
     |                               29-1069.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Neurologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
415. |                               onetsocc~e                               |
     |                               29-1069.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                            Nuclear Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
416. |                               onetsocc~e                               |
     |                               29-1069.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Ophthalmologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
417. |                               onetsocc~e                               |
     |                               29-1069.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Pathologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
418. |                               onetsocc~e                               |
     |                               29-1069.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                        Physical Medicine and Rehabilitation Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
419. |                               onetsocc~e                               |
     |                               29-1069.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Preventive Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
420. |                               onetsocc~e                               |
     |                               29-1069.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Radiologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
421. |                               onetsocc~e                               |
     |                               29-1069.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Sports Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
422. |                               onetsocc~e                               |
     |                               29-1069.12                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                             Urologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
430. |                               onetsocc~e                               |
     |                               29-1125.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Recreational Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
431. |                               onetsocc~e                               |
     |                               29-1125.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Art Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
432. |                               onetsocc~e                               |
     |                               29-1125.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Music Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
498. |                               onetsocc~e                               |
     |                               31-9099.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                   Speech-Language Pathology Assistants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              31-9099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
499. |                               onetsocc~e                               |
     |                               31-9099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Endoscopy Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              31-9099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
511. |                               onetsocc~e                               |
     |                               33-3021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Police Detectives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
512. |                               onetsocc~e                               |
     |                               33-3021.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                             Police Identification and Records Officers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
513. |                               onetsocc~e                               |
     |                               33-3021.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Criminal Investigators and Special Agents |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
514. |                               onetsocc~e                               |
     |                               33-3021.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Immigration and Customs Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
515. |                               onetsocc~e                               |
     |                               33-3021.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Intelligence Analysts |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
556. |                               onetsocc~e                               |
     |                               39-1021.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                     First-Line Supervisors of Personal Service Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              39-1021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
557. |                               onetsocc~e                               |
     |                               39-1021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Spa Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              39-1021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
614. |                               onetsocc~e                               |
     |                               43-3021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Statement Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
615. |                               onetsocc~e                               |
     |                               43-3021.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Billing, Cost, and Rate Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-3021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
623. |                               onetsocc~e                               |
     |                               43-4031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Court Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
624. |                               onetsocc~e                               |
     |                               43-4031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Municipal Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
625. |                               onetsocc~e                               |
     |                               43-4031.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         License Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
628. |                               onetsocc~e                               |
     |                               43-4051.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                       Customer Service Representatives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4051              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
629. |                               onetsocc~e                               |
     |                               43-4051.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Patient Representatives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4051              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
652. |                               onetsocc~e                               |
     |                               43-5081.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                              Stock Clerks, Sales Floor |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
653. |                               onetsocc~e                               |
     |                               43-5081.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Marking Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
654. |                               onetsocc~e                               |
     |                               43-5081.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                    Stock Clerks- Stockroom, Warehouse, or Storage Yard |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
655. |                               onetsocc~e                               |
     |                               43-5081.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Order Fillers, Wholesale and Retail Sales |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
673. |                               onetsocc~e                               |
     |                               45-1011.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              First-Line Supervisors of Logging Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
674. |                               onetsocc~e                               |
     |                               45-1011.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                         First-Line Supervisors of Aquacultural Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
675. |                               onetsocc~e                               |
     |                               45-1011.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |  First-Line Supervisors of Agricultural Crop and Horticultural Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
676. |                               onetsocc~e                               |
     |                               45-1011.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |     First-Line Supervisors of Animal Husbandry and Animal Care Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
738. |                               onetsocc~e                               |
     |                               47-4099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                               Solar Thermal Installers and Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              47-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
739. |                               onetsocc~e                               |
     |                               47-4099.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Weatherization Installers and Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              47-4099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
892. |                               onetsocc~e                               |
     |                               51-9071.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                               Jewelers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
893. |                               onetsocc~e                               |
     |                               51-9071.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Gem and Diamond Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
894. |                               onetsocc~e                               |
     |                               51-9071.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Precious Metal Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
917. |                               onetsocc~e                               |
     |                               53-1021.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     | First-Line Supervisors of Helpers, Laborers, and Material Movers, Hand |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              53-1021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
918. |                               onetsocc~e                               |
     |                               53-1021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Recycling Coordinators |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              53-1021              |                     0              |
     +------------------------------------------------------------------------+

. collapse (mean) teleworkable `jobs_chars_vars' [w=n], by(SOC_2010)
(analytic weights assumed)

. merge 1:m SOC_2010 using `tf_soc_bls', keep(using match)

    Result                           # of obs.
    -----------------------------------------
    not matched                            48
        from master                         0  (_merge==1)
        from using                         48  (_merge==2)

    matched                               773  (_merge==3)
    -----------------------------------------

. assert strpos(OES_TITLE,"All Other")!=0|OES_TITLE=="Legislators"|strpos(OES_T
> ITLE,"Miscellaneous")==1 if _merge==2

. drop if _merge==2
(48 observations deleted)

. drop _merge

. bys OES_2018: egen total = total(1)

. by  OES_2018: egen stddev_telew = sd(telew)
(756 missing values generated)

. list OES_2018 SOC_2010 telew if total!=1 & stddev_telew!=0 //Taking simple av
> erages (employment reported by OES_2018, not SOC_2010)

     +--------------------------------+
     | OES_2018   SOC_2010   telewo~e |
     |--------------------------------|
162. |  21-1018    21-1011          1 |
163. |  21-1018    21-1014          0 |
559. |  47-4090    47-4091          0 |
560. |  47-4090    47-4099    .397351 |
727. |  53-1048    53-1031          1 |
     |--------------------------------|
728. |  53-1048    53-1021    .586742 |
     +--------------------------------+

. collapse (mean) teleworkable `jobs_chars_vars' (firstnm) OES_TITLE, by(OES_20
> 18)

. clonevar OCC_CODE = OES_2018

. tempfile bls_explore

. save `bls_explore', replace
(note: file C:\Users\Rafael\AppData\Local\Temp\ST_00000004.tmp not found)
file C:\Users\Rafael\AppData\Local\Temp\ST_00000004.tmp saved

. 
. *************************************************************************
. ****BLS Codes Characteristics Explore************************************
. *************************************************************************
. //Load national SOC data
. import excel using "../input/national_M2018_dl.xlsx", clear firstrow

. keep if OCC_GROUP=="detailed"
(571 observations deleted)

. //Merge with ONET-based coding of teleworkability and other vars; fill in "mi
> scellaneous" categories using 4-digit means
. merge 1:1 OCC_CODE using `bls_explore'

    Result                           # of obs.
    -----------------------------------------
    not matched                            48
        from master                        46  (_merge==1)
        from using                          2  (_merge==2)

    matched                               762  (_merge==3)
    -----------------------------------------

. gen str OCC_CODE_4digit = substr(OCC_CODE,1,10)

. foreach var of varlist teleworkable `jobs_chars_vars' { 
  2. local name = substr("`var'",1,25)
  3. bys OCC_CODE_4digit: egen numer_`name' = total(`var'*TOT_EMP)
  4. bys OCC_CODE_4digit: egen denom_`name' = total(TOT_EMP)
  5. gen `name'_4digit = numer_`name' / denom_`name'
  6. replace `var' = `name'_4digit if missing(`var')==1 & (substr(OCC_CODE,-1,1
> )=="9"|substr(OCC_CODE,-2,2)=="90"|OCC_CODE=="11-1031") & (strpos(OCC_TITLE,"
> All Other")!=0|strpos(OCC_TITLE,"Miscellaneous")!=0|OCC_TITLE=="Legislators")
>  //
  7. assert missing(`var')==0
  8. }
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)
(2 missing values generated)
(46 real changes made)

. drop _merge numer* denom* *_4digit

. 
. //Generate employment-weighted and wage-weighted means and report them
. replace H_MEAN = "100" if H_MEAN=="#"
(0 real changes made)

. destring H_MEAN, replace ig(*)
H_MEAN: character * removed; replaced as double
(61 missing values generated)

. 
. foreach var of varlist `jobs_chars_vars' {
  2.         assert missing(`var')==0
  3. }

. gen byte cannotworkfromhome = (email_lessthanmonthly!=0|outdoors_everyday!=0|
> violentpeople_atleastweekly!=0|safetyequip_majority!=0|minorhurt_atleastweekl
> y!=0|physical_activities!=0|handlingobjects!=0|control_machines!=0|operate_eq
> uipment!=0|dealwithpublic!=0|repair_mechequip!=0|repair_elecequip!=0|inspect_
> equip!=0|disease_atleastweekly!=0|walking_majority!=0)

. gen int cannotworkfromhome_sum = (email_lessthanmonthly!=0) + (outdoors_every
> day!=0) + (violentpeople_atleastweekly!=0) + (safetyequip_majority!=0) + (min
> orhurt_atleastweekly!=0) + (physical_activities!=0) + (handlingobjects!=0) + 
> (control_machines!=0) + (operate_equipment!=0) + (dealwithpublic!=0) + (repai
> r_mechequip!=0) + (repair_elecequip!=0) + (inspect_equip!=0) + (disease_atlea
> stweekly!=0) + (walking_majority!=0)

. foreach var of varlist `jobs_chars_vars' {
  2.         count if inlist(`var',0,1)==0 & cannotworkfromhome_sum==1
  3. }
  0
  0
  0
  0
  0
  1
  0
  0
  0
  0
  0
  0
  6
  0
  8

. quietly count if cannotworkfromhome_sum == 1

. local obs_singlecondition = `r(N)'

. display "There are `r(N)' observations in which only one survey response caus
> es the occupation to be classified as unable to be performed at home."
There are 133 observations in which only one survey response causes the occupat
> ion to be classified as unable to be performed at home.

. 
. egen emp_denom  = total(TOT_EMP)

. egen emp_denom_sole = total(TOT_EMP) if cannotworkfromhome_sum==1
(677 missing values generated)

. egen wage_denom = total(H_MEAN*TOT_EMP*(missing(H_MEAN)==0))

. egen wage_denom_sole = total(H_MEAN*TOT_EMP*(missing(H_MEAN)==0)) if cannotwo
> rkfromhome_sum==1
(677 missing values generated)

. 
. foreach var of varlist `jobs_chars_vars' {
  2. quietly {
  3.         egen en_`var'  = total(`var'*TOT_EMP)
  4.         egen ens_`var'  = total(`var'*TOT_EMP) if cannotworkfromhome_sum==
> 1
  5.         egen wn_`var' = total(`var'*H_MEAN*TOT_EMP*(missing(H_MEAN)==0))
  6.         egen wns_`var' = total(`var'*H_MEAN*TOT_EMP*(missing(H_MEAN)==0)) 
> if cannotworkfromhome_sum==1
  7. }
  8. }

. 
. collapse (firstnm) emp_denom emp_denom_sole wage_denom wage_denom_sole en_* e
> ns_* wn_* wns_*

. gen i = _n

. reshape long en_ ens_ wn_ wns_, i(i) j(trait) string
(note: j = control_machines dealwithpublic disease_atleastweekly email_lessthan
> monthly handlingobjects inspect_equip minorhurt_atleastweekly operate_equipme
> nt outdoors_everyday physical_activities repair_elecequip repair_mechequip sa
> fetyequip_majority violentpeople_atleastweekly walking_majority)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        1   ->      15
Number of variables                  65   ->      10
j variable (15 values)                    ->   trait
xij variables:
en_control_machines en_dealwithpublic ... en_walking_majority->en_
ens_control_machines ens_dealwithpublic ... ens_walking_majority->ens_
wn_control_machines wn_dealwithpublic ... wn_walking_majority->wn_
wns_control_machines wns_dealwithpublic ... wns_walking_majority->wns_
-----------------------------------------------------------------------------

. gen str mean_emp       = string(en_ / emp_denom,"%3.2f")

. gen str mean_emp_sole  = string(ens_ / emp_denom_sole,"%3.2f")

. gen str mean_wage      = string(wn_ / wage_denom,"%3.2f")

. gen str mean_wage_sole = string(wns_ / wage_denom_sole,"%3.2f")

. gen str mean_emp_sole_fulldenom  = string(ens_ / emp_denom,"%4.3f")

. gen mean_emp_sole_fulldenom_num = ens_ / emp_denom

. gen str mean_wage_sole_fulldenom = string(wns_ / wage_denom,"%4.3f")

. keep trait mean_*

. 
. gen str trait_label = trait  //GWA labels are "is very important", WC are "av
> erage respondent says..."

. replace trait_label = subinstr(trait_label,"repair_elecequip","GWA23: Repairi
> ng and Maintaining Electronic Equipment",1)
variable trait_label was str27 now str53
(1 real change made)

. replace trait_label = subinstr(trait_label,"violentpeople_atleastweekly","WC1
> 4: Deal with violent people weekly",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"repair_mechequip","GWA22: Repairi
> ng and Maintaining Mechanical Equipment",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"minorhurt_atleastweekly","WC33: E
> xposed to minor burns, cuts, bites, or stings weekly",1)
variable trait_label was str53 now str59
(1 real change made)

. replace trait_label = subinstr(trait_label,"outdoors_everyday","WC17/18: Majo
> rity of respondents say outdoors every day",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"control_machines","GWA18: Control
> ling Machines and Processes",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"operate_equipment","GWA20: Operat
> ing Vehicles, Mechanized Devices, or Equipment",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"disease_atleastweekly","WC29: Exp
> osed to diseases or infection weekly",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"handlingobjects","GWA17: Handling
>  and Moving Objects",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"physical_activities","GWA16: Perf
> orming General Physical Activities",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"inspect_equip","GWA4: Inspecting 
> Equipment, Structures, or Materials",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"email_lessthanmonthly","WC4: Use 
> email less than once per month",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"dealwithpublic","GWA32: Performin
> g for or Working Directly with the Public",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"walking_majority","WC37: Majority
>  of time walking or running",1)
(1 real change made)

. replace trait_label = subinstr(trait_label,"safetyequip_majority","WC43/44: M
> ajority of time wearing protective or safety equipment",1)
variable trait_label was str59 now str64
(1 real change made)

. 
. sort mean_emp

. listtex trait_label mean_emp mean_wage mean_emp_sole_fulldenom mean_wage_sole
> _fulldenom using "../output/ONET_questions_contributions.tex", replace ///
> rstyle(tabular) head("\begin{tabular}{lcccc} \toprule" "&\multicolumn{2}{c}{C
> annot do at home} &\multicolumn{2}{c}{Sole condition} \\" "\cmidrule(lr){2-3}
>  \cmidrule(lr){4-5}" "O*NET survey condition& Jobs & Wages & Jobs & Wages\\" 
> "\midrule") foot("\bottomrule \end{tabular}")
command listtex is unrecognized
r(199);

end of do-file
r(199);
