
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 8-core Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Rafael
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "country_level_measures.do" 

. clear

. 
. // === Generate 6-digit SOC to 2-digit ISCO crosswalk ===
. 
. //2-digit ISCO code and title
. import delimited using "../input/ilostat-2020-04-10.csv", clear
(18 vars, 14,786 obs)

. keep classif1 classif1label

. duplicates drop

Duplicates in terms of all variables

(14,711 observations deleted)

. drop if inlist(classif1,"OC2_ISCO08_TOTAL","OC2_ISCO08_X")==1 | strpos(classi
> f1,"OC2_ISCO08")==0
(32 observations deleted)

. gen ISCO08_TITLE_2digit= subinstr(classif1label,"Occupation (ISCO-08), 2 digi
> t level: ","",1)

. assert substr(classif1,-2,2) == substr(ISCO08_TITLE_2digit,1,2)

. gen ISCO08_Code_2digit = substr(classif1,-2,2)

. keep ISCO08_Code_2digit ISCO08_TITLE_2digit

. compress
  (0 bytes saved)

. tempfile ISCO08_2digit

. save `ISCO08_2digit'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000001.tmp saved

. 
. //SOC to ISCO Crosswalk
. import excel using "../input/ISCO_SOC_Crosswalk.xls", cellrange(A7:E1132) fir
> strow clear

. drop part

. gen SOC_2010 = trim(SOCCode)

. gen str ISCO08_Code_2digit = substr(ISCO08Code,1,2)

. keep ISCO08_Code_2digit SOC_2010 SOCTitle

. duplicates drop

Duplicates in terms of all variables

(163 observations deleted)

. merge m:1 ISCO08_Code_2digit using `ISCO08_2digit', assert(match) keepusing(I
> SCO08_TITLE_2digit) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               962  
    -----------------------------------------

. tempfile ISCO_2digit_SOC_Crosswalk

. save `ISCO_2digit_SOC_Crosswalk' //This mapping is many (2-digit 2008 ISCO) t
> o many (6-digit 2010 SOC)
file C:\Users\Rafael\AppData\Local\Temp\ST_00000002.tmp saved

. 
. // === Generate 2018 OES code to 6-digit SOC crosswalk ===
. 
. import excel using "../input/oes_2019_hybrid_structure.xlsx", sheet(OES2019 H
> ybrid) cellrange(A6:H874) clear firstrow

. rename (OES2018EstimatesCode OES2018EstimatesTitle) (OES_2018 OES_TITLE)

. rename (G H) (SOC_2010 SOC_TITLE)

. replace OES_TITLE = trim(OES_TITLE)
(49 real changes made)

. keep OES_2018 OES_TITLE SOC_2010 SOC_TITLE

. duplicates drop

Duplicates in terms of all variables

(47 observations deleted)

. tempfile OES_SOC_temp

. bys SOC_2010: egen total = total(1)

. assert total==1 | SOC_2010=="25-3099" //This is many (SOC_2010) to one (OES_2
> 018) except for SOC=25-3099 (misc teachers)

. list if SOC_2010=="25-3099" //OES distinguishes between substitute teachers a
> nd others

     +-----------------------------------------------------------------+
243. |                            OES_2018                             |
     |                             25-3097                             |
     |-----------------------------------------------------------------|
     |                                                       OES_TITLE |
     | Teachers and Instructors, All Other, Except Substitute Teachers |
     |-----------------------------------------------------------------|
     |  SOC_2010   |                            SOC_TITLE   |  total   |
     |   25-3099   |  Teachers and Instructors, All Other   |      2   |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
244. |                            OES_2018                             |
     |                             25-3098                             |
     |-----------------------------------------------------------------|
     |                                                       OES_TITLE |
     |                                             Substitute Teachers |
     |-----------------------------------------------------------------|
     |  SOC_2010   |                            SOC_TITLE   |  total   |
     |   25-3099   |  Teachers and Instructors, All Other   |      2   |
     +-----------------------------------------------------------------+

. replace SOC_2010 = OES_2018 if SOC_2010 == "25-3099" //This makes the SOC_201
> 0 values in this crosswalk unique.
(2 real changes made)

. keep OES_2018 OES_TITLE SOC_2010 SOC_TITLE

. save `OES_SOC_temp'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000003.tmp saved

. 
. 
. // === Generate 2018 OES code to 2-digit ISCO crosswalk ===
. use "`ISCO_2digit_SOC_Crosswalk'", clear

. drop if substr(SOC_2010,1,3)=="55-" //Drops military occupations
(20 observations deleted)

. merge m:1 SOC_2010 using `OES_SOC_temp'

    Result                           # of obs.
    -----------------------------------------
    not matched                             3
        from master                         1  (_merge==1)
        from using                          2  (_merge==2)

    matched                               941  (_merge==3)
    -----------------------------------------

. assert inlist(SOC_2010,"25-3099","25-3097","25-3098") if _merge!=3

. replace ISCO08_TITLE_2digit = "23 - Teaching professionals" if inlist(OES_201
> 8,"25-3097","25-3098") & _merge==2 & missing(ISCO08_Code_2digit)==1
(2 real changes made)

. replace ISCO08_Code_2digit = "23" if inlist(OES_2018,"25-3097","25-3098") & _
> merge==2 & missing(ISCO08_Code_2digit)==1
(2 real changes made)

. drop if _merge==1
(1 observation deleted)

. drop _merge

. keep ISCO08_Code_2digit ISCO08_TITLE_2digit OES_2018 OES_TITLE

. duplicates drop

Duplicates in terms of all variables

(10 observations deleted)

. sort OES_2018

. clonevar OCC_CODE = OES_2018

. tempfile OES_ISCO_2digit_Crosswalk

. save `OES_ISCO_2digit_Crosswalk' //This mapping is many (OES_2018 / OCC_CODE)
>  to many (ISCO08_Code)
file C:\Users\Rafael\AppData\Local\Temp\ST_00000004.tmp saved

. 
. // ===  Construct country-level teleworkability index === 
. 
. //Load US OES employment counts to use as weights; map to 2-digit ISCO
. import excel using "../input/national_M2018_dl.xlsx", firstrow clear

. keep if OCC_GROUP=="detailed"
(571 observations deleted)

. merge 1:m OCC_CODE using `OES_ISCO_2digit_Crosswalk', keep(3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               928  
    -----------------------------------------

. merge m:1 OCC_CODE using "../input/onet_teleworkable_blscodes.dta", keep(1 3)
>  nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                            60
        from master                        60  
        from using                          0  

    matched                               868  
    -----------------------------------------

. keep OCC_CODE OCC_TITLE TOT_EMP ISCO08_Code ISCO08_TITLE teleworkable

. rename TOT_EMP USA_OES_employment

. tempfile oes_isco2_merged_file

. save `oes_isco2_merged_file' //This file is many-to-many
file C:\Users\Rafael\AppData\Local\Temp\ST_00000005.tmp saved

. 
. //Load and clean ILO data on 2-digit ISCO employment by country
. import delim using "../input/ilostat-2020-04-10.csv", clear
(18 vars, 14,786 obs)

. rename (ref_area ref_arealabel time obs_value) (country_code country year emp
> loyment)

. assert inlist(substr(classif1,1,10),"OC2_ISCO88","OC2_ISCO08")

. bys country_code: egen int year_max = max(year)

. assert year<=year_max

. keep if year==year_max & sex == "SEX_T" //Use most recent year of data and di
> sregard sex
(10,661 observations deleted)

. assert inlist(country_code,"BWA","CRI","IDN","IND","KOS","NAM","NGA","NIC","P
> NG") | inlist(country_code,"TUN","TZA", "VNM", "YEM", "ZAF") if substr(classi
> f1,1,10) != "OC2_ISCO08"

. drop if substr(classif1,1,10) != "OC2_ISCO08" //Drop 14 countries using older
>  ISCO codes in their most recent year
(177 observations deleted)

. tempvar tv1 tv2

. bys country_code year: egen `tv1' = max((classif1=="OC2_ISCO08_X")*employment
> )

. by  country_code year: egen `tv2' = max((classif1=="OC2_ISCO08_TOTAL")*employ
> ment)

. gen unallocated_employment_share = `tv1'/`tv2'

. drop `tv1' `tv2'

. drop if inlist(classif1,"OC2_ISCO08_TOTAL","OC2_ISCO08_X")==1
(161 observations deleted)

. gen ISCO08_Code_2digit = substr(classif1,-2,2)

. gen ISCO08_TITLE_2digit= subinstr(classif1label,"Occupation (ISCO-08), 2 digi
> t level: ","",1)

. drop if inlist(ISCO08_Code_2digit,"01","02","03") // Drop military occupation
> s
(171 observations deleted)

. 
. //Join ISCO 2-digit employment with US-based telework scores and OES employme
> nt weights
. joinby ISCO08_Code_2digit using `oes_isco2_merged_file', unmatched(both)

. assert _merge==3

. egen tag = tag(country_code year OCC_CODE ISCO08_Code)

. assert tag!=0

. drop _merge tag

. 
. //Aggregate 6-digit SOC telework scores to country-specific 2-digit ISCO scor
> es
. bys country_code year OCC_CODE: egen tot_emp_occ = total(employment) if missi
> ng(employment)==0 & employment!=0
(1162 missing values generated)

. gen weight = USA_OES_employment*employment/tot_emp_occ  if missing(employment
> )==0 & employment!=0 //Allocates SOC's employment across ISCOs in proportion 
> to ISCO employment shares
(1,162 missing values generated)

. collapse (mean) teleworkable (firstnm) emp country ISCO08_TITLE_2digit unallo
> cated_employment_share [aweight = weight], by(country_code year ISCO08_Code)

. 
. save "../output/country_isco08_telework.dta", replace
(note: file ../output/country_isco08_telework.dta not found)
file ../output/country_isco08_telework.dta saved

. 
end of do-file
