
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 8-core Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Rafael
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "table.do" 

. //Compute correlations with MSA traits
. //Produce table of highest and lowest cities; statement of range; only among 
> 100 largest MSAs (by employment)
. 
. local keepnum = 10

. local keepnumstr = "ten"

. 
. use "../input/MSA_2018_teleworkable_onet.dta", clear

. clonevar cbsa = AREA

. recode cbsa (70900=12700) (71650=14460) (78100=44140) (79600 = 49340) (70750 
> = 12620) (71950 = 14860) (72400 = 15540) (73450 = 25540) (75700 = 35300) (764
> 50 = 35980) (76750 = 38860) (77200 = 39300) (74650=30340) (74950=31700) (7660
> 0=38340) //Recode NECTAs to work with CBSA codes in ACS 2018 characteristics 
> file
(cbsa: 15 changes made)

. drop if inlist(AREA,72850,73050,74500,75550,76900,78700) //NECTAs that do not
>  appear in ACS CBSA geography
(6 observations deleted)

. merge 1:1 cbsa using "../input/CBSA_characteristics_5yr.dta", assert(using ma
> tch) // keep(match) nogen
(note: variable cbsa was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           556
        from master                         0  (_merge==1)
        from using                        556  (_merge==2)

    matched                               389  (_merge==3)
    -----------------------------------------

. 
. //Report correlations with MSA traits
. correlate teleworkable_emp frac_ba
(obs=389)

             | telewo~p  frac_ba
-------------+------------------
teleworkab~p |   1.0000
     frac_ba |   0.7112   1.0000


. assert inrange(r(rho),0.5,1.0)

. local rho_ba = string(r(rho),"%3.2f")

. correlate teleworkable_emp median_income
(obs=389)

             | telewo~p median~e
-------------+------------------
teleworkab~p |   1.0000
median_inc~e |   0.5334   1.0000


. assert inrange(r(rho),0.5,1.0)

. local rho_income = string(r(rho),"%3.2f")

. correlate teleworkable_emp frac_own
(obs=389)

             | telewo~p frac_own
-------------+------------------
teleworkab~p |   1.0000
    frac_own |  -0.3085   1.0000


. assert inrange(r(rho),-1.0,0.0)

. local rho_own = string(r(rho),"%3.2f") 

. correlate teleworkable_emp frac_white
(obs=389)

             | telewo~p frac_w~e
-------------+------------------
teleworkab~p |   1.0000
  frac_white |  -0.1233   1.0000


. assert inrange(r(rho),-1.0,0.0)

. local rho_white = string(r(rho),"%3.2f")

. shell echo "Across all metropolitan areas, the share of jobs that can be perf
> ormed at home is strongly positively correlated with median household income 
> (`rho_income') and its share of residents who attained a college degree (`rho
> _ba') and negatively correlated with its home ownership rate (`rho_own') and 
> its share of residents who are white (`rho_white').%" > ../output/MSA_correla
> tes.tex
request ignored because of batch mode

. 
. //Restrict attention to 100 largest MSAs (by employment) to produce top & bot
> tom table
. tempvar tv0

. egen `tv0' = rank(MSA_totalemployment), field
(556 missing values generated)

. keep if inrange(`tv0',1,100)
(845 observations deleted)

. 
. tempvar tv1 tv2

. egen `tv1' = rank(teleworkable_emp), field

. egen `tv2' = rank(teleworkable_emp), track

. 
. keep if inrange(`tv1',1,`keepnum') | inrange(`tv2',1,`keepnum')
(80 observations deleted)

. gen row = (`tv1')*inrange(`tv1',1,`keepnum') + (2*`keepnum'+1-`tv2')*inrange(
> `tv2',1,`keepnum')

. 
. //Format numbers suitable for table output
. gen str tele_emp_str = string(teleworkable_emp,"%3.2f")

. gen str tele_wage_str = string(teleworkable_wage,"%3.2f")

. foreach var of varlist frac_ba frac_own frac_white{
  2.         gen str `var'_str = string(`var',"%3.2f")
  3. }

. gen str median_income_thousands = string(median_income/1000,"%3.0f")

. 
. 
. sort row

. qui summarize teleworkable_emp if row==1

. local top_num = string(100*`r(mean)',"%3.0f")

. local top_msa = AREA_NAME[1]

. qui summarize teleworkable_emp if row==2*`keepnum'

. local bot_num = string(100*`r(mean)',"%3.0f")

. local bot_msa = AREA_NAME[2*`keepnum']

. shell echo -n "from `bot_num' percent in `bot_msa' to `top_num' percent in `t
> op_msa'%" > ../output/MSA_range.tex
request ignored because of batch mode

. 
. gen msa_name = AREA_NAME

. replace msa_name = "topnum" + AREA_NAME if row==1
(1 real change made)

. replace msa_name = "botnum" + AREA_NAME if row==(1+`keepnum')
(1 real change made)

. 
. listtex msa_name tele_emp_str tele_wage_str frac_ba_str median_income_thousan
> ds frac_white_str frac_own_str using "../output/MSA_telework_top`keepnum'bott
> om`keepnum'_table_char.tex", replace ///
> rstyle(tabular) head("\begin{tabular}{lcc|cccc} \toprule" " & \multicolumn{2}
> {c}{Share of jobs} & \multicolumn{4}{c}{Metropolitan characteristics} \\" " &
> & Weighted & BA & Median & White & Owner \\" "& Unweighted & by wage & share 
> & income & share & share \\" "\midrule") foot("\bottomrule \end{tabular}")
(note: file ../output/MSA_telework_top10bottom10_table_char.tex not found)

. 
. shell sed -i.bak 's/^topnum/\\underline{\\textit{Top `keepnumstr'}}\\\\/' ../
> output/MSA_telework_top`keepnum'bottom`keepnum'_table_char.tex
request ignored because of batch mode

. shell sed -i.bak 's/^botnum/\\\\ \\underline{\\textit{Bottom `keepnumstr'}}\\
> \\/' ../output/MSA_telework_top`keepnum'bottom`keepnum'_table_char.tex
request ignored because of batch mode

. rm ../output/MSA_telework_top`keepnum'bottom`keepnum'_table_char.tex.bak
file ../output/MSA_telework_top10bottom10_table_char.tex.bak not found
r(601);

end of do-file
r(601);
