
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 8-core Stata perpetual license:
       Serial number:  10699393
         Licensed to:  Rafael
                       

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "crosswalk.do" 

. //MAP O*NET TELEWORK SCORE to BLS's 6-digit SOC categories
. 
. tempfile tf_onet_soc tf_soc_bls tf_bls_telework

. 
. import excel using "../input/2010_to_SOC_Crosswalk.xlsx", firstrow cellrange(
> A4:D1114) clear

. rename ONETSOC2010Code onetsoccode

. rename SOCCode SOC_2010

. rename SOCTitle SOC_TITLE

. save `tf_onet_soc'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000001.tmp saved

. 
. import excel using "../input/oes_2019_hybrid_structure.xlsx", sheet(OES2019 H
> ybrid) cellrange(A6:H874) clear firstrow

. rename (OES2018EstimatesCode OES2018EstimatesTitle) (OES_2018 OES_TITLE)

. rename (G H) (SOC_2010 SOC_TITLE)

. keep OES_2018 OES_TITLE SOC_2010 SOC_TITLE

. replace OES_TITLE = trim(OES_TITLE)
(49 real changes made)

. duplicates drop

Duplicates in terms of all variables

(47 observations deleted)

. save `tf_soc_bls'
file C:\Users\Rafael\AppData\Local\Temp\ST_00000002.tmp saved

. 
. use "../input/onet_teleworkable.dta", clear

. merge 1:1 onetsoccode using `tf_onet_soc', assert(using match) keep(match) ke
> epusing(SOC_2010) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               968  
    -----------------------------------------

. bys SOC_2010: egen total = total(1)

. by  SOC_2010: egen stddev_telew = sd(telew)
(678 missing values generated)

. list onetsoccode title SOC_2010 teleworkable if total!=1 & stddev_telew!=0 //
> Taking survey-respondent-weighted averages to get to SOC_2010

     +------------------------------------------------------------------------+
 19. |                               onetsocc~e                               |
     |                               11-3071.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Transportation Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 20. |                               onetsocc~e                               |
     |                               11-3071.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Storage and Distribution Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 21. |                               onetsocc~e                               |
     |                               11-3071.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Logistics Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-3071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 34. |                               onetsocc~e                               |
     |                               11-9041.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                 Architectural and Engineering Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 35. |                               onetsocc~e                               |
     |                               11-9041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |         Biofuels/Biodiesel Technology and Product Development Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 48. |                               onetsocc~e                               |
     |                               11-9199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                            Regulatory Affairs Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 49. |                               onetsocc~e                               |
     |                               11-9199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Compliance Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 50. |                               onetsocc~e                               |
     |                               11-9199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Investment Fund Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 51. |                               onetsocc~e                               |
     |                               11-9199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Supply Chain Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 52. |                               onetsocc~e                               |
     |                               11-9199.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Security Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 53. |                               onetsocc~e                               |
     |                               11-9199.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Loss Prevention Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 54. |                               onetsocc~e                               |
     |                               11-9199.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Wind Energy Operations Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 55. |                               onetsocc~e                               |
     |                               11-9199.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Wind Energy Project Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 56. |                               onetsocc~e                               |
     |                               11-9199.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                 Brownfield Redevelopment Specialists and Site Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              11-9199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 64. |                               onetsocc~e                               |
     |                               13-1041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                    Environmental Compliance Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 65. |                               onetsocc~e                               |
     |                               13-1041.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Licensing Examiners and Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 66. |                               onetsocc~e                               |
     |                               13-1041.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                         Equal Opportunity Representatives and Officers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 67. |                               onetsocc~e                               |
     |                               13-1041.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                       Government Property Inspectors and Investigators |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 68. |                               onetsocc~e                               |
     |                               13-1041.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                               Coroners |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 69. |                               onetsocc~e                               |
     |                               13-1041.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Regulatory Affairs Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 83. |                               onetsocc~e                               |
     |                               13-1199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Energy Auditors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 84. |                               onetsocc~e                               |
     |                               13-1199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Security Management Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 85. |                               onetsocc~e                               |
     |                               13-1199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Customs Brokers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 86. |                               onetsocc~e                               |
     |                               13-1199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Business Continuity Planners |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 87. |                               onetsocc~e                               |
     |                               13-1199.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Sustainability Specialists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
 88. |                               onetsocc~e                               |
     |                               13-1199.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Online Merchants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              13-1199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
143. |                               onetsocc~e                               |
     |                               17-1022.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                              Surveyors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-1022              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
144. |                               onetsocc~e                               |
     |                               17-1022.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Geodetic Surveyors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-1022              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
157. |                               onetsocc~e                               |
     |                               17-2111.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                 Industrial Safety and Health Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
158. |                               onetsocc~e                               |
     |                               17-2111.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                               Fire-Prevention and Protection Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
159. |                               onetsocc~e                               |
     |                               17-2111.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Product Safety Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2111              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
160. |                               onetsocc~e                               |
     |                               17-2112.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Industrial Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2112              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
161. |                               onetsocc~e                               |
     |                               17-2112.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                Human Factors Engineers and Ergonomists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2112              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
162. |                               onetsocc~e                               |
     |                               17-2121.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Marine Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2121              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
163. |                               onetsocc~e                               |
     |                               17-2121.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Marine Architects |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2121              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
165. |                               onetsocc~e                               |
     |                               17-2141.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Mechanical Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
166. |                               onetsocc~e                               |
     |                               17-2141.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Fuel Cell Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
167. |                               onetsocc~e                               |
     |                               17-2141.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Automotive Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2141              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
171. |                               onetsocc~e                               |
     |                               17-2199.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Biochemical Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
172. |                               onetsocc~e                               |
     |                               17-2199.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                   Validation Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
173. |                               onetsocc~e                               |
     |                               17-2199.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Energy Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
174. |                               onetsocc~e                               |
     |                               17-2199.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Manufacturing Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
175. |                               onetsocc~e                               |
     |                               17-2199.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Mechatronics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
176. |                               onetsocc~e                               |
     |                               17-2199.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Microsystems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
177. |                               onetsocc~e                               |
     |                               17-2199.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Photonics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
178. |                               onetsocc~e                               |
     |                               17-2199.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                     Robotics Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
179. |                               onetsocc~e                               |
     |                               17-2199.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Nanosystems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
180. |                               onetsocc~e                               |
     |                               17-2199.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Wind Energy Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
181. |                               onetsocc~e                               |
     |                               17-2199.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Solar Energy Systems Engineers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-2199              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
208. |                               onetsocc~e                               |
     |                               17-3031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Surveying Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-3031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
209. |                               onetsocc~e                               |
     |                               17-3031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                    Mapping Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              17-3031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
217. |                               onetsocc~e                               |
     |                               19-1029.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                              Bioinformatics Scientists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
218. |                               onetsocc~e                               |
     |                               19-1029.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Molecular and Cellular Biologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
219. |                               onetsocc~e                               |
     |                               19-1029.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                            Geneticists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1029              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
220. |                               onetsocc~e                               |
     |                               19-1031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                        Soil and Water Conservationists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
221. |                               onetsocc~e                               |
     |                               19-1031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Range Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
222. |                               onetsocc~e                               |
     |                               19-1031.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Park Naturalists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-1031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
258. |                               onetsocc~e                               |
     |                               19-4041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Geophysical Data Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
259. |                               onetsocc~e                               |
     |                               19-4041.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Geological Sample Test Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
262. |                               onetsocc~e                               |
     |                               19-4061.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Social Science Research Assistants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4061              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
263. |                               onetsocc~e                               |
     |                               19-4061.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                       City and Regional Planning Aides |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4061              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
267. |                               onetsocc~e                               |
     |                               19-4099.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                               Quality Control Analysts |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
268. |                               onetsocc~e                               |
     |                               19-4099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                      Precision Agriculture Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
269. |                               onetsocc~e                               |
     |                               19-4099.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Remote Sensing Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              19-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
365. |                               onetsocc~e                               |
     |                               27-2012.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                              Producers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
366. |                               onetsocc~e                               |
     |                               27-2012.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |               Directors- Stage, Motion Pictures, Television, and Radio |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
367. |                               onetsocc~e                               |
     |                               27-2012.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Program Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
368. |                               onetsocc~e                               |
     |                               27-2012.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Talent Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
369. |                               onetsocc~e                               |
     |                               27-2012.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Technical Directors/Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2012              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
375. |                               onetsocc~e                               |
     |                               27-2041.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                        Music Directors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2041              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
376. |                               onetsocc~e                               |
     |                               27-2041.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                          Music Composers and Arrangers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              27-2041              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
411. |                               onetsocc~e                               |
     |                               29-1069.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                           Allergists and Immunologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
412. |                               onetsocc~e                               |
     |                               29-1069.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Dermatologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
413. |                               onetsocc~e                               |
     |                               29-1069.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Hospitalists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
414. |                               onetsocc~e                               |
     |                               29-1069.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Neurologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
415. |                               onetsocc~e                               |
     |                               29-1069.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                            Nuclear Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
416. |                               onetsocc~e                               |
     |                               29-1069.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Ophthalmologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
417. |                               onetsocc~e                               |
     |                               29-1069.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Pathologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
418. |                               onetsocc~e                               |
     |                               29-1069.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                        Physical Medicine and Rehabilitation Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
419. |                               onetsocc~e                               |
     |                               29-1069.09                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Preventive Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
420. |                               onetsocc~e                               |
     |                               29-1069.10                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Radiologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
421. |                               onetsocc~e                               |
     |                               29-1069.11                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                             Sports Medicine Physicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
422. |                               onetsocc~e                               |
     |                               29-1069.12                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                             Urologists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1069              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
430. |                               onetsocc~e                               |
     |                               29-1125.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Recreational Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
431. |                               onetsocc~e                               |
     |                               29-1125.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Art Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
432. |                               onetsocc~e                               |
     |                               29-1125.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Music Therapists |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              29-1125              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
498. |                               onetsocc~e                               |
     |                               31-9099.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                   Speech-Language Pathology Assistants |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              31-9099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
499. |                               onetsocc~e                               |
     |                               31-9099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Endoscopy Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              31-9099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
511. |                               onetsocc~e                               |
     |                               33-3021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                      Police Detectives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
512. |                               onetsocc~e                               |
     |                               33-3021.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                             Police Identification and Records Officers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
513. |                               onetsocc~e                               |
     |                               33-3021.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Criminal Investigators and Special Agents |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
514. |                               onetsocc~e                               |
     |                               33-3021.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                     Immigration and Customs Inspectors |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
515. |                               onetsocc~e                               |
     |                               33-3021.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                  Intelligence Analysts |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              33-3021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
556. |                               onetsocc~e                               |
     |                               39-1021.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                     First-Line Supervisors of Personal Service Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              39-1021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
557. |                               onetsocc~e                               |
     |                               39-1021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Spa Managers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              39-1021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
614. |                               onetsocc~e                               |
     |                               43-3021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Statement Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-3021              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
615. |                               onetsocc~e                               |
     |                               43-3021.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                         Billing, Cost, and Rate Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-3021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
623. |                               onetsocc~e                               |
     |                               43-4031.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                           Court Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
624. |                               onetsocc~e                               |
     |                               43-4031.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                       Municipal Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
625. |                               onetsocc~e                               |
     |                               43-4031.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         License Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4031              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
628. |                               onetsocc~e                               |
     |                               43-4051.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                       Customer Service Representatives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4051              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
629. |                               onetsocc~e                               |
     |                               43-4051.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Patient Representatives |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-4051              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
652. |                               onetsocc~e                               |
     |                               43-5081.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                              Stock Clerks, Sales Floor |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
653. |                               onetsocc~e                               |
     |                               43-5081.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                         Marking Clerks |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
654. |                               onetsocc~e                               |
     |                               43-5081.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                    Stock Clerks- Stockroom, Warehouse, or Storage Yard |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
655. |                               onetsocc~e                               |
     |                               43-5081.04                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Order Fillers, Wholesale and Retail Sales |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              43-5081              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
673. |                               onetsocc~e                               |
     |                               45-1011.05                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              First-Line Supervisors of Logging Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
674. |                               onetsocc~e                               |
     |                               45-1011.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                         First-Line Supervisors of Aquacultural Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
675. |                               onetsocc~e                               |
     |                               45-1011.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |  First-Line Supervisors of Agricultural Crop and Horticultural Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
676. |                               onetsocc~e                               |
     |                               45-1011.08                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |     First-Line Supervisors of Animal Husbandry and Animal Care Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              45-1011              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
738. |                               onetsocc~e                               |
     |                               47-4099.02                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                               Solar Thermal Installers and Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              47-4099              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
739. |                               onetsocc~e                               |
     |                               47-4099.03                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                              Weatherization Installers and Technicians |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              47-4099              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
892. |                               onetsocc~e                               |
     |                               51-9071.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                               Jewelers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
893. |                               onetsocc~e                               |
     |                               51-9071.06                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                Gem and Diamond Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
894. |                               onetsocc~e                               |
     |                               51-9071.07                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Precious Metal Workers |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              51-9071              |                     0              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
917. |                               onetsocc~e                               |
     |                               53-1021.00                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     | First-Line Supervisors of Helpers, Laborers, and Material Movers, Hand |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              53-1021              |                     1              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
918. |                               onetsocc~e                               |
     |                               53-1021.01                               |
     |------------------------------------------------------------------------|
     |                                                                  title |
     |                                                 Recycling Coordinators |
     |------------------------------------------------------------------------|
     |             SOC_2010              |              telewo~e              |
     |              53-1021              |                     0              |
     +------------------------------------------------------------------------+

. collapse (mean) telew [w=n], by(SOC_2010)
(analytic weights assumed)

. merge 1:m SOC_2010 using `tf_soc_bls', keep(using match)

    Result                           # of obs.
    -----------------------------------------
    not matched                            48
        from master                         0  (_merge==1)
        from using                         48  (_merge==2)

    matched                               773  (_merge==3)
    -----------------------------------------

. assert strpos(OES_TITLE,"All Other")!=0|OES_TITLE=="Legislators"|strpos(OES_T
> ITLE,"Miscellaneous")==1 if _merge==2

. drop if _merge==2
(48 observations deleted)

. drop _merge

. bys OES_2018: egen total = total(1)

. by  OES_2018: egen stddev_telew = sd(telew)
(756 missing values generated)

. list OES_2018 SOC_2010 telew if total!=1 & stddev_telew!=0 //Taking simple av
> erages (employment reported by OES_2018, not SOC_2010)

     +--------------------------------+
     | OES_2018   SOC_2010   telewo~e |
     |--------------------------------|
162. |  21-1018    21-1011          1 |
163. |  21-1018    21-1014          0 |
559. |  47-4090    47-4091          0 |
560. |  47-4090    47-4099    .397351 |
727. |  53-1048    53-1031          1 |
     |--------------------------------|
728. |  53-1048    53-1021    .586742 |
     +--------------------------------+

. collapse (mean) telew (firstnm) OES_TITLE, by(OES_2018)

. clonevar OCC_CODE = OES_2018

. 
. save "../output/onet_teleworkable_blscodes.dta", replace
(note: file ../output/onet_teleworkable_blscodes.dta not found)
file ../output/onet_teleworkable_blscodes.dta saved

. export delimited OCC_CODE OES_TITLE telew using "../output/onet_teleworkable_
> blscodes.csv", replace
file ../output/onet_teleworkable_blscodes.csv saved

. 
end of do-file
